# =============================================================================
# Brewfile - Mac DevOps Engineer
# Install: brew bundle --file=~/git/linux-configs/mac/Brewfile
# =============================================================================

# ---- Taps ----
tap "hashicorp/tap"
tap "fluxcd/tap"
tap "felixkratz/formulae"

# ---- Core CLI (modern replacements) ----
brew "eza"                # ls replacement
brew "bat"                # cat replacement
brew "fd"                 # find replacement
brew "ripgrep"            # grep replacement
brew "fzf"                # fuzzy finder
brew "zoxide"             # smart cd
brew "btop"               # system monitor
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "tree"
brew "wget"
brew "coreutils"          # GNU date, etc.
brew "gnu-sed"            # GNU sed

# ---- Shell & Prompt ----
brew "starship"           # cross-shell prompt
brew "atuin"              # shell history search
brew "direnv"             # per-directory env vars

# ---- Git ----
brew "git"
brew "git-delta"          # better git diffs
brew "lazygit"            # git TUI
brew "gh"                 # GitHub CLI
brew "gitleaks"           # secret scanning

# ---- DevOps / Cloud ----
brew "awscli"
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "ansible"

# ---- Kubernetes ----
brew "kubectl"
brew "kubectx"            # context/namespace switching
brew "helm"
brew "k9s"                # Kubernetes TUI
brew "argocd"
brew "stern"              # multi-pod log tailing

# ---- Containers ----
brew "lazydocker"         # Docker TUI
brew "dive"               # inspect image layers
brew "trivy"              # vulnerability scanner

# ---- Languages ----
brew "go"
brew "python@3.12"
brew "node"

# ---- Editor ----
brew "neovim"
brew "stow"               # dotfiles symlink manager

# ---- Modern CLI (Tier 1 additions) ----
brew "tlrc"               # tldr client (Rust) - manpages for humans
brew "mkcert"             # locally-trusted dev TLS certs
brew "gum"                # interactive shell scripts
brew "just"               # command runner (Makefile alternative)
brew "dust"               # modern du
brew "duf"                # modern df
brew "procs"              # modern ps
brew "bottom"             # modern top/htop (binary: btm)
brew "xh"                 # modern httpie (Rust)
brew "fx"                 # interactive JSON viewer
brew "glow"               # terminal markdown renderer
brew "yamllint"           # YAML linter
brew "git-absorb"         # auto-fixup commits
brew "tree-sitter-cli"    # required by nvim-treesitter main branch to compile parsers
brew "felixkratz/formulae/borders"  # JankyBorders focus ring

# ---- Kubernetes power-user ----
brew "kubescape"          # K8s security scanner (NSA/CIS/MITRE)
brew "kubecolor"          # color-wraps every kubectl call
brew "helm-docs"          # auto-generate helm chart docs
brew "kustomize"          # K8s manifest customization
brew "kind"               # local K8s clusters in Docker
brew "helmfile"           # declarative helm releases
brew "fluxcd/tap/flux"    # Flux GitOps CLI

# =============================================================================
# GUI Applications
# =============================================================================
cask "ghostty"
cask "visual-studio-code"
cask "rancher"            # Rancher Desktop (Kubernetes + container management)
cask "raycast"            # launcher, window tiling, keyboard shortcuts
cask "alt-tab"            # keyboard window switcher (Cmd+Tab replacement)
cask "google-chrome"
cask "slack"
cask "whatsapp"
cask "bitwarden"
cask "spotify"
cask "stats"              # menu bar system monitor
cask "font-jetbrains-mono-nerd-font"
